[
  {
    "id": 1,
    "type": "speaking",
    "topic": "Lesson 1: Greetings & Farewells",
    "icon": "👋",
    "phrases": [
      { "en": "Good morning! How are you doing today?", "my": "မင်္ဂလာနံနက်ခင်းပါ။ ဒီနေ့ နေကောင်းလား။" },
      { "en": "I'm doing well, thanks for asking.", "my": "နေကောင်းပါတယ်။ မေးတဲ့အတွက် ကျေးဇူးပါ။" },
      { "en": "It's a beautiful day, isn't it?", "my": "ဒီနေ့ ရာသီဥတု သာယာတယ်နော်။" },
      { "en": "It was great seeing you again!", "my": "ပြန်တွေ့ရတာ ဝမ်းသာပါတယ်။" },
      { "en": "I should probably get going now.", "my": "ကျွန်တော် အခု သွားရတော့မယ်။" },
      { "en": "Take care and have a wonderful evening.", "my": "ဂရုစိုက်ပါ၊ ပျော်ရွှင်စရာ ညနေခင်းလေး ဖြစ်ပါစေ။" },
      { "en": "See you around, neighbor!", "my": "ပြန်တွေ့ကြတာပေါ့ အိမ်နီးချင်းရေ။" },
      { "en": "Have a safe trip home.", "my": "အိမ်ကို ဘေးကင်းစွာ ပြန်နိုင်ပါစေ။" },
      { "en": "Catch you later!", "my": "နောက်မှ ပြန်တွေ့ကြမယ်။" },
      { "en": "It was a lovely party, thank you for inviting me.", "my": "တကယ်ကို ပျော်စရာကောင်းတဲ့ ပါတီလေးပါ၊ ဖိတ်ကြားတဲ့အတွက် ကျေးဇူးပါ။" }
    ]
  },
  {
    "id": 2,
    "type": "speaking",
    "topic": "Lesson 2: Informal 'Yes' & 'No'",
    "icon": "💬",
    "phrases": [
      { "en": "Yeah, definitely!", "my": "အေးလေ၊ သေချာပေါ့။" },
      { "en": "Nope, not at all.", "my": "ဟင့်အင်း၊ လုံးဝမဟုတ်ဘူး။" },
      { "en": "Yep, I'm on it.", "my": "အင်း၊ ကျွန်တော် လုပ်နေပြီ။" },
      { "en": "Nah, I'm good for now.", "my": "ဟင့်အင်း၊ အခုတော့ ရပါတယ်။" },
      { "en": "Sure thing!", "my": "ရတာပေါ့!" },
      { "en": "I don't think so.", "my": "မထင်ပါဘူး။" },
      { "en": "You bet!", "my": "သေချာတာပေါ့။" },
      { "en": "Not really, to be honest.", "my": "အမှန်အတိုင်း ပြောရရင် သိပ်တော့ မဟုတ်ဘူး။" },
      { "en": "Sounds about right.", "my": "ဟုတ်လောက်ပါတယ်။" },
      { "en": "No way, seriously?", "my": "မဖြစ်နိုင်တာ၊ တကယ်လား။" }
    ]
  },
  {
    "id": 3,
    "type": "speaking",
    "topic": "Lesson 3: The 'How Are You?' Dance",
    "icon": "💃",
    "phrases": [
      { "en": "How's it going?", "my": "ဘယ်လိုလဲ၊ အဆင်ပြေရဲ့လား။" },
      { "en": "Not too bad, you?", "my": "မဆိုးပါဘူး၊ မင်းကော။" },
      { "en": "Can't complain!", "my": "မဆိုးပါဘူး (အကုန်အဆင်ပြေပါတယ်)။" },
      { "en": "Pretty good, busy as usual.", "my": "အဆင်ပြေပါတယ်၊ ပုံမှန်အတိုင်း အလုပ်ရှုပ်နေတာပေါ့။" },
      { "en": "Same old, same old.", "my": "ဒီလိုပါပဲ၊ အရင်အတိုင်းပါပဲ။" },
      { "en": "Just hanging in there.", "my": "ဒီလိုပဲ ကြိုးစားဖြတ်သန်းနေတာပါ။" },
      { "en": "I've been better.", "my": "နေလို့ ကောင်းလာပါပြီ။" },
      { "en": "How have you been lately?", "my": "နောက်ပိုင်း ဘယ်လိုလဲ၊ နေကောင်းလား။" },
      { "en": "Keeping busy, you know how it is.", "my": "အလုပ်ရှုပ်နေတာပေါ့၊ မင်းသိတဲ့အတိုင်းပဲ။" },
      { "en": "Everything's coming along nicely.", "my": "အားလုံး အဆင်ပြေချောမွေ့နေပါတယ်။" }
    ]
  },
  {
    "id": 4,
    "type": "speaking",
    "topic": "Lesson 4: Responding to 'What’s Up?'",
    "icon": "🤙",
    "phrases": [
      { "en": "Not much, just chilling.", "my": "ဘာမှ ထွေထွေထူးထူး မဟုတ်ပါဘူး၊ အေးဆေးပါပဲ။" },
      { "en": "Nothing special, just the usual.", "my": "ထူးထူးခြားခြား မရှိပါဘူး၊ ပုံမှန်အတိုင်းပါပဲ။" },
      { "en": "Oh, just getting some work done.", "my": "အလုပ်လေးတွေ နည်းနည်း လုပ်နေတာပါ။" },
      { "en": "Working hard or hardly working?", "my": "အလုပ်တွေ အပြင်းအထန် လုပ်နေတာလား၊ အပျင်းထူနေတာလား။" },
      { "en": "Just heading home from the gym.", "my": "ဂျင်ကနေ အိမ်ပြန်လာတာပါ။" },
      { "en": "I'm just about to grab some coffee.", "my": "ကော်ဖီ သွားသောက်မလို့ပါ။" },
      { "en": "Watching the latest series, what about you?", "my": "ဇာတ်လမ်းတွဲအသစ် ကြည့်နေတာ၊ မင်းကော။" },
      { "en": "Not much, what's up with you?", "my": "ဘာမှ မဟုတ်ပါဘူး၊ မင်းကော ဘာတွေ ထူးလဲ။" },
      { "en": "Just trying to survive Monday!", "my": "တနင်္လာနေ့ကို အဆင်ပြေအောင် ဖြတ်သန်းနေတာပါ။" },
      { "en": "The usual grind, you know?", "my": "ဒီလိုပဲ ပုံမှန်အတိုင်း ရုန်းကန်နေရတာပေါ့၊ သိတယ်မလား။" }
    ]
  },
  {
    "id": 5,
    "type": "speaking",
    "topic": "Lesson 5: Self-Introductions",
    "icon": "🤝",
    "phrases": [
      { "en": "Hi, I'm Adrian, the new marketing lead.", "my": "မင်္ဂလာပါ၊ ကျွန်တော် Adrian ပါ၊ မားကတ်တင်း တာဝန်ခံအသစ်ပါ။" },
      { "en": "It's a pleasure to meet you all.", "my": "အားလုံးနဲ့ တွေ့ရတာ ဝမ်းသာပါတယ်။" },
      { "en": "I've heard great things about this company.", "my": "ဒီကုမ္ပဏီအကြောင်း ကောင်းတာတွေ အများကြီး ကြားဖူးပါတယ်။" },
      { "en": "I'll be working in the design department.", "my": "ကျွန်တော် ဒီဇိုင်းဌာနမှာ အလုပ်လုပ်မှာပါ။" },
      { "en": "I recently moved here from London.", "my": "ကျွန်တော် မကြာသေးခင်ကမှ လန်ဒန်ကနေ ဒီကို ပြောင်းလာတာပါ။" },
      { "en": "I'm looking forward to working with everyone.", "my": "အားလုံးနဲ့ အတူတူ အလုပ်လုပ်ဖို့ မျှော်လင့်နေပါတယ်။" },
      { "en": "Feel free to stop by my desk and say hello.", "my": "ကျွန်တော့်စားပွဲကို လာခဲ့ပြီး နှုတ်ဆက်လို့ ရပါတယ်နော်။" },
      { "en": "I've been in this industry for about five years.", "my": "ကျွန်တော် ဒီလုပ်ငန်းနယ်ပယ်ထဲမှာ ၅ နှစ်လောက် ရှိပါပြီ။" },
      { "en": "In my free time, I love hiking and photography.", "my": "အားလပ်ချိန်မှာ တောင်တက်တာနဲ့ ဓာတ်ပုံရိုက်တာ ဝါသနာပါပါတယ်။" },
      { "en": "Let's grab lunch sometime and get to know each other.", "my": "တစ်ခါတလေ နေ့လည်စာ အတူစားရင်း တစ်ယောက်အကြောင်းတစ်ယောက် သိအောင် လုပ်ကြတာပေါ့။" }
    ]
  },
  {
    "id": 6,
    "type": "test",
    "topic": "🔴 Test 1: Social Openers",
    "icon": "🎯",
    "phrases": [
      { "en": "How ya doin'?", "my": "နေကောင်းလား။" },
      { "en": "I'm fine, thanks.", "my": "နေကောင်းပါတယ်၊ ကျေးဇူးပါ။" },
      { "en": "What's going on?", "my": "ဘာတွေ ဖြစ်နေလဲ။" },
      { "en": "Long time no see!", "my": "မတွေ့တာ ကြာပြီနော်။" },
      { "en": "Nice to finally meet you in person.", "my": "အပြင်မှာ အခုလို လူချင်းတွေ့ရတာ ဝမ်းသာပါတယ်။" },
      { "en": "How's your day been so far?", "my": "ဒီနေ့ အခုထိတော့ ဘယ်လိုလဲ၊ အဆင်ပြေရဲ့လား။" },
      { "en": "Can't complain, life is good.", "my": "မဆိုးပါဘူး၊ ဘဝက နေပျော်ပါတယ်။" },
      { "en": "Are you new here?", "my": "ဒီကို အသစ်ရောက်တာလား။" },
      { "en": "I'm just passing through.", "my": "ကျွန်တော် ဖြတ်သွားဖြတ်လာ လုပ်တာပါ။" },
      { "en": "Hope you have a great one!", "my": "ကောင်းသောနေ့လေး ဖြစ်ပါစေလို့ မျှော်လင့်ပါတယ်။" }
    ]
  },
  {
    "id": 7,
    "type": "speaking",
    "topic": "Lesson 6: Deep Gratitude",
    "icon": "🙏",
    "phrases": [
      { "en": "I can't thank you enough for everything.", "my": "အားလုံးအတွက် မင်းကို ဘယ်လို ကျေးဇူးတင်ရမှန်းတောင် မသိတော့ဘူး။" },
      { "en": "I'm truly grateful for your support.", "my": "မင်းရဲ့ အကူအညီအတွက် တကယ်ကို ကျေးဇူးတင်မိပါတယ်။" },
      { "en": "You have no idea how much this means to me.", "my": "ဒါက ကျွန်တော့်အတွက် ဘယ်လောက် အဓိပ္ပာယ်ရှိလဲဆိုတာ မင်းမသိနိုင်ပါဘူး။" },
      { "en": "I'm so indebted to you.", "my": "မင်းအပေါ်မှာ ကျေးဇူးတွေ အများကြီး တင်နေပါပြီ။" },
      { "en": "Thank you for going above and beyond.", "my": "အခုထက်ပိုပြီး ကူညီပေးတဲ့အတွက် ကျေးဇူးတင်ပါတယ်။" },
      { "en": "I really appreciate you stepping in to help.", "my": "ဝင်ကူညီပေးတဲ့အတွက် တကယ်ကို ကျေးဇူးတင်ပါတယ်။" },
      { "en": "That was incredibly kind of you.", "my": "မင်းက တကယ်ကို ကြင်နာတတ်တာပဲ။" },
      { "en": "You're a lifesaver, seriously!", "my": "မင်းက တကယ်ကို ကယ်တင်ရှင်ပါပဲ!" },
      { "en": "I'll never forget what you did for me.", "my": "မင်း ကျွန်တော့်အတွက် လုပ်ပေးခဲ့တာကို ဘယ်တော့မှ မေ့မှာ မဟုတ်ဘူး။" },
      { "en": "Words can't express how thankful I am.", "my": "ဘယ်လောက် ကျေးဇူးတင်လဲဆိုတာ စကားလုံးနဲ့တောင် ဖော်ပြလို့ မရပါဘူး။" }
    ]
  },
  {
    "id": 8,
    "type": "speaking",
    "topic": "Lesson 7: Gracious Responses",
    "icon": "😊",
    "phrases": [
      { "en": "Don't mention it, it was nothing.", "my": "မပြောပါနဲ့၊ ဒါက ဘာမှမဟုတ်ပါဘူး။" },
      { "en": "I'm just glad I could help.", "my": "ကူညီခွင့်ရတဲ့အတွက် ဝမ်းသာပါတယ်။" },
      { "en": "Anytime, you know I've got your back.", "my": "အချိန်မရွေးပါ၊ ငါ မင်းဘက်မှာ ရှိနေတာ သိတယ်မလား။" },
      { "en": "It was the least I could do.", "my": "ဒါက ကျွန်တော် လုပ်ပေးနိုင်တဲ့ အနည်းဆုံး အရာပါ။" },
      { "en": "No worries, happy to be of service.", "my": "စိတ်မပူပါနဲ့၊ ကူညီပေးရတာ ဝမ်းသာပါတယ်။" },
      { "en": "It was my pleasure, truly.", "my": "ကျွန်တော့်အတွက် တကယ်ကို ဝမ်းသာစရာပါ။" },
      { "en": "You would have done the same for me.", "my": "မင်းလည်း ငါ့အတွက်ဆိုရင် ဒီလိုပဲ လုပ်ပေးမှာပါ။" },
      { "en": "Don't sweat it, it's all good.", "my": "စိတ်မပူပါနဲ့၊ အားလုံး အဆင်ပြေပါတယ်။" },
      { "en": "Glad to see everything worked out.", "my": "အားလုံး အဆင်ပြေသွားတာ မြင်ရလို့ ဝမ်းသာပါတယ်။" },
      { "en": "I'm always here if you need anything else.", "my": "တခြား တစ်ခုခု လိုအပ်ရင်လည်း အမြဲတမ်း ရှိနေပါတယ်။" }
    ]
  },
  {
    "id": 9,
    "type": "speaking",
    "topic": "Lesson 8: Owning Mistakes",
    "icon": "🙇",
    "phrases": [
      { "en": "I'm so sorry, I completely forgot about our meeting.", "my": "တောင်းပန်ပါတယ်၊ တို့တွေ တွေ့ဖို့ကို လုံးဝ မေ့သွားလို့ပါ။" },
      { "en": "I take full responsibility for the error.", "my": "ဒီအမှားအတွက် ကျွန်တော် အပြည့်အဝ တာဝန်ယူပါတယ်။" },
      { "en": "It was my fault, I should have double-checked.", "my": "ဒါက ကျွန်တော့်အမှားပါ၊ သေချာ ပြန်စစ်သင့်ခဲ့တာပါ။" },
      { "en": "I apologize for being so rude earlier.", "my": "စောစောက ရိုင်းစိုင်းမိခဲ့တာကို တောင်းပန်ပါတယ်။" },
      { "en": "Please forgive me, I didn't mean to hurt your feelings.", "my": "ကျေးဇူးပြုပြီး ခွင့်လွှတ်ပါ၊ စိတ်နာအောင် လုပ်ဖို့ ရည်ရွယ်ချက် မရှိပါဘူး။" },
      { "en": "I messed up and I'm truly sorry.", "my": "ကျွန်တော် အမှားလုပ်မိသွားတယ်၊ တကယ်ကို တောင်းပန်ပါတယ်။" },
      { "en": "How can I make it up to you?", "my": "ဘယ်လို ပြန်ပြီး အစားထိုး ပေးရမလဲ။" },
      { "en": "I'll make sure it doesn't happen again.", "my": "ဒါမျိုး ထပ်မဖြစ်စေရဘူးလို့ အာမခံပါတယ်။" },
      { "en": "I realize I was in the wrong.", "my": "ကျွန်တော် မှားသွားမှန်း သိလိုက်ပါပြီ။" },
      { "en": "I hope you can accept my sincere apology.", "my": "ကျွန်တော့်ရဲ့ ရိုးသားတဲ့ တောင်းပန်မှုကို လက်ခံနိုင်မယ်လို့ မျှော်လင့်ပါတယ်။" }
    ]
  },
  {
    "id": 10,
    "type": "speaking",
    "topic": "Lesson 9: Accepting Apologies",
    "icon": "🤝",
    "phrases": [
      { "en": "That's okay, don't worry about it.", "my": "ရပါတယ်၊ အဲဒါအတွက် စိတ်မပူပါနဲ့။" },
      { "en": "Apology accepted, let's move on.", "my": "တောင်းပန်တာကို လက်ခံပါတယ်၊ ဒါကို ထားလိုက်ကြရအောင်။" },
      { "en": "It's forgotten, no harm done.", "my": "မေ့လိုက်ပါပြီ၊ ဘာမှ မဖြစ်ပါဘူး။" },
      { "en": "I appreciate you saying that.", "my": "မင်း အခုလို ပြောတာကို ကျေးဇူးတင်ပါတယ်။" },
      { "en": "Everyone makes mistakes, it's fine.", "my": "လူတိုင်း အမှားလုပ်တတ်ကြတာပဲ၊ ရပါတယ်။" },
      { "en": "I'm glad we cleared that up.", "my": "ဒါကို ရှင်းရှင်းလင်းလင်း ဖြစ်သွားအောင် လုပ်နိုင်ခဲ့လို့ ဝမ်းသာပါတယ်။" },
      { "en": "Let's just try to be more careful next time.", "my": "နောက်တစ်ခါတော့ ပိုသတိထားကြတာပေါ့။" },
      { "en": "No hard feelings, really.", "my": "တကယ်ပါ၊ စိတ်ထဲမှာ ဘာမှ မရှိတော့ပါဘူး။" },
      { "en": "I forgive you, let's not mention it again.", "my": "ခွင့်လွှတ်ပါတယ်၊ ဒါကို ထပ်မပြောကြတော့ဘူးလေ။" },
      { "en": "Water under the bridge, right?", "my": "ပြီးခဲ့တာတွေ ပြီးပါပြီ၊ ဟုတ်တယ်မလား။" }
    ]
  },
  {
    "id": 11,
    "type": "speaking",
    "topic": "Lesson 10: Active Listening",
    "icon": "👂",
    "phrases": [
      { "en": "Oh wow, that's incredible!", "my": "အို၊ အံ့သြစရာပဲ။" },
      { "en": "I see what you mean.", "my": "မင်းဘာကို ဆိုလိုတာလဲဆိုတာ ငါသိပြီ။" },
      { "en": "That must have been so difficult for you.", "my": "ဒါက မင်းအတွက် တကယ်ကို ခက်ခဲခဲ့မှာပဲ။" },
      { "en": "Go on, I'm listening.", "my": "ဆက်ပြောပါ၊ ငါ နားထောင်နေပါတယ်။" },
      { "en": "Wait, what happened next?", "my": "နေပါဦး၊ နောက် ဘာဆက်ဖြစ်လဲ။" },
      { "en": "I can't imagine how you felt.", "my": "မင်း ဘယ်လို ခံစားခဲ့ရမလဲဆိုတာတောင် စဉ်းစားလို့ မရဘူး။" },
      { "en": "That makes a lot of sense.", "my": "ဒါက တကယ်ကို အဓိပ္ပာယ်ရှိပါတယ်။" },
      { "en": "So, what did you do after that?", "my": "ဒါနဲ့၊ အဲဒါပြီးတော့ မင်းဘာလုပ်လဲ။" },
      { "en": "Tell me more about it.", "my": "အဲဒါကို နောက်ထပ် ပြောပြပါဦး။" },
      { "en": "I totally get where you're coming from.", "my": "မင်း ဘာကြောင့် အဲလိုဖြစ်လဲဆိုတာ ငါ လုံးဝ နားလည်ပါတယ်။" }
    ]
  },
  {
    "id": 12,
    "type": "test",
    "topic": "🔴 Test 2: The Politeness Pivot",
    "icon": "🎯",
    "phrases": [
      { "en": "I owe you one.", "my": "မင်းကို ကျေးဇူးကြွေး တစ်ခု တင်သွားပြီ။" },
      { "en": "Much obliged!", "my": "ကျေးဇူးတင်ပါတယ်။" },
      { "en": "Pardon me, I didn't see you there.", "my": "တောင်းပန်ပါတယ်၊ မင်း အဲမှာ ရှိနေတာ မမြင်လိုက်လို့ပါ။" },
      { "en": "I'm terribly sorry for the delay.", "my": "နောက်ကျသွားတဲ့အတွက် တကယ်ကို တောင်းပန်ပါတယ်။" },
      { "en": "No problem at all, take your time.", "my": "ဘာမှ မဖြစ်ပါဘူး၊ အေးဆေး လုပ်ပါ။" },
      { "en": "I appreciate your patience.", "my": "မင်းရဲ့ စိတ်ရှည်မှုအတွက် ကျေးဇူးတင်ပါတယ်။" },
      { "en": "You're too kind, thank you.", "my": "မင်းက တကယ်ကို ကြင်နာတာပဲ၊ ကျေးဇူးပါ။" },
      { "en": "Could you do me a quick favor?", "my": "အကူအညီလေး တစ်ခုလောက် ပေးနိုင်မလား။" },
      { "en": "I'd be happy to help you with that.", "my": "ဒါကို ကူညီပေးရတာ ဝမ်းသာပါတယ်။" },
      { "en": "It's the least I could do for a friend.", "my": "ဒါက သူငယ်ချင်းတစ်ယောက်အတွက် ငါလုပ်ပေးနိုင်တဲ့ အနည်းဆုံး အရာပါ။" }
    ]
  }
]
